#include <iostream>
#include "Task1.h"
using namespace std;

//-------------------------------------------------------------------------------------------------
// Реализуйте шаблонную функцию Swap, которая принимает два указателя и обменивает
// местами значения, на которые указывают эти указатели(нужно обменивать именно сами
//     указатели, переменные должны оставаться в тех же адресах памяти).
//-------------------------------------------------------------------------------------------------

template <class T>  void Swap(T*& p1, T*& p2)
{
    T* temp = p1;
    p1 = p2;
    p2 = temp;
}

void task_1()
{
    cout << endl << "========== TASK 1 ==========" << endl << endl;
    int* i1, * i2;

    i1 = new int{ 10 };
    i2 = new int{ 20 };

    cout << *i1 << " " << *i2 << endl;
    cout << hex << i1 << " " << i2 << endl;

    Swap<int>(i1, i2);
    cout << dec << *i1 << " " << *i2 << endl;
    cout << hex << i1 << " " << i2 << endl;
    cout << dec;

}